authz_benchmark/jmeter_report/k8s_1ng_1j_3r_9600t_600e_4cpu_10g_async2_https_http2/h2load.out
starting benchmark...
spawning thread #0: 9600 total client(s). Timing-based test with 0s of warm-up time and 900s of main duration for measurements.
Warm-up started for thread #0.
progress: 10% of clients started
progress: 20% of clients started
progress: 30% of clients started
progress: 40% of clients started
progress: 50% of clients started
progress: 60% of clients started
progress: 70% of clients started
progress: 80% of clients started
progress: 90% of clients started
progress: 100% of clients started
Warm-up phase is over for thread #0.
Main benchmark duration is started for thread #0.
TLS Protocol: TLSv1.3
Cipher: TLS_AES_256_GCM_SHA384
Server Temp Key: X25519 253 bits
Application protocol: h2
Main benchmark duration is over for thread #0. Stopping all clients.
Stopped all clients for thread #0

finished in 901.91s, 2493.92 req/s, 18.75MB/s
requests: 2244524 total, 2254124 started, 2244524 done, 2244524 succeeded, 0 failed, 0 errored, 0 timeout
status codes: 2244524 2xx, 0 3xx, 0 4xx, 0 5xx
traffic: 16.48GB (17697028865) total, 218.34MB (228941448) headers (space savings 32.00%), 16.19GB (17381593856) data
                     min         max         mean         sd        +/- sd
time for request:   194.73ms       7.33s       3.84s    223.62ms    87.02%
time for connect:   784.55ms       5.30s       2.93s       1.32s    58.13%
time to 1st byte:      4.36s      11.86s       6.85s       1.75s    65.65%
req/s           :       0.26        0.26        0.26        0.00    56.89%